Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
# Before useing Pandas we need to import

import pandas as pd # pd is alias name of pandas

data = [4,8,15,16,23,42]
var = pd.Series(data)
print(var)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it.

In [2]:
li = [34,54,86,43,89,12,65,87,54,78]
var1 = pd.Series(li)
print(var1)

0    34
1    54
2    86
3    43
4    89
5    12
6    65
7    87
8    54
9    78
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [3]:
data1 = {'Name' : ['Alice', 'Bob', 'Claire'], 'Age': [25,30,27], 'Gender': ['Female', 'Male', 'Female']}
var2 = pd.DataFrame(data1)
var2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

### DataFrame:
is a two-dimensional, size-mutable, and heterogeneous tabular data structure. It is similar to a spreadsheet or a SQL table and can be thought of as a collection of Series objects where each Series represents a column. A DataFrame consists of rows and columns, where each column can have a different data type, but all columns within a DataFrame must have the same length.

### The main difference:
is that a Series represents a single column of data, while a DataFrame represents a collection of Series objects, forming a two-dimensional table-like structure with multiple columns. DataFrames are more suitable for handling complex datasets with multiple variables, while Series are typically used for single variables or one-dimensional data.

In [5]:
# Creating a Series
s = pd.Series([1, 2, 3, 4, 5], name="Series")
print("Series:")
print(s)

# Creating a DataFrame
df = pd.DataFrame({"A": [1, 2, 3, 4, 5], "B": [10, 20, 30, 40, 50]})
print("\nDataFrame:")
print(df)

Series:
0    1
1    2
2    3
3    4
4    5
Name: Series, dtype: int64

DataFrame:
   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

#### Filtering Data:

df[df['column_name'] > value]: Use this to filter rows based on a condition. For example, to select rows where a certain column has values greater than a specific threshold.

#### Sorting Data:
df.sort_values('column_name'): Use this to sort the DataFrame by one or more columns in ascending order.
df.sort_values('column_name', ascending=False): Use this to sort in descending order.

#### Pivoting Data:
df.pivot(index='row_column', columns='column_column', values='value_column'): Use this to reshape data, converting rows into columns.

#### Adding and Removing Columns:
df['new_column'] = some_values: Use this to add a new column to the DataFrame.
df.drop('column_name', axis=1): Use this to remove a column from the DataFrame.

#### Handling Missing Data:
df.dropna(): Use this to remove rows with missing values.
df.fillna(value): Use this to fill missing values with a specified value.

#### Grouping and Aggregation:
df.groupby('group_column')['agg_column'].agg('function'): Use this to group data by a column and apply aggregation functions (e.g., sum, mean, count) to another column within each group.

#### Merging and Joining Data:
pd.merge(df1, df2, on='key_column'): Use this to combine two DataFrames based on a common column.

In [7]:
# By using data1 perfroming some pandas function

var2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [9]:
var2.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [11]:
var2.tail(2) #Displaying Last 2 Records

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [13]:
var2.dropna() #Droping NaN value if found

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
var2.fillna('Mani') #Filling  null values with specified value

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [15]:
var2.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [16]:
var2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

### DataFrame:
DataFrame is a two-dimensional tabular data structure and is mutable. You can modify its data, add or remove columns, and perform various operations to change its contents.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [19]:
Seri = {'A': pd.Series([23,54,65,32]), 'B': pd.Series([65,89,65,90])}
df5 = pd.DataFrame(Seri)
df5

    A   B
0  23  65
1  54  89
2  65  65
3  32  90

In [20]:
#OR

# Creating two Series
s1 = pd.Series([1, 2, 3, 4], name='A')
s2 = pd.Series(['apple', 'banana', 'cherry', 'date'], name='B')

# Combining the Series into a DataFrame
df = pd.DataFrame({'Column1': s1, 'Column2': s2})

print(df)

   Column1 Column2
0        1   apple
1        2  banana
2        3  cherry
3        4    date